In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [92]:
df = pd.read_csv('births.txt',header=None,index_col=0)
df.columns=['x','y']
df.index.name='year'

In [5]:
df

            x        y
year
1880    90993   110491
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[132 rows x 2 columns]

In [ ]:
# 1.남아수 총합을 구하시요
# 2.여아수 평균을 구하시요
# 3.남아수가 가장많은 년도와
# 남아수를 구하시요
# 4.2000년도 이후 데이터를
# 구하시요
# 5. 1995~ 2000 년도 데이터를
# 구하시요

In [26]:
#1.
df.loc[:,'x'].sum()

161802441

In [29]:
#2.
df.iloc[:,1].mean()

1245399.2121212122

In [45]:
#3.
x_max_year = df.loc[:,'x'].idxmax()
x_max_num = df.loc[:,'x'].max()
y_max_year = df.loc[:,'y'].idxmax()
y_max_num = df.loc[:,'y'].max()
print(f'남아수가 가장 많은 년도:{x_max_year}, 가장 많은 남아수:{x_max_num}')

남아수가 가장 많은 년도:1957, 가장 많은 남아수:2044160

In [38]:
#4.
df[df.index >= 2000]

            x        y
year
2000  1814601  1962406
2001  1799049  1941251
2002  1795206  1939815
2003  1825359  1973434
2004  1834145  1982794
2005  1845379  1994841
2006  1898463  2052377
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

In [39]:
df.query('1995 <= index <= 2000')

            x        y
year
1995  1757927  1902832
1996  1752249  1893378
1997  1739806  1884122
1998  1765915  1910250
1999  1772632  1918809
2000  1814601  1962406

In [ ]:
# 6. 남아출생이 가장많은 top5
# 를 구하시요(년도와 남아수)
# 7. 남아율(%) 컬럼을 추가하고 각년도별
# 남아수가 차지하는비율을 데이터로
# 보여주시요.
# 8. 2000년도 이후데이터 에 대해
# 출생량 컬럼을 추가하고
# 남아수가 1800000 이상이면 '많음'아니면 '적음'
# 이라고 보여 주시요
# 	남아수 출생량
# 2000   1233   '많음'
# 2001   1234   '적음'
# 9.1800년대,1900년대,2000년대 
# 각 남아,여야수 평균을 구하시요

In [48]:
#6.
df.loc[:,'x'].nlargest(5,keep='all')

year
1957    2044160
1959    2023044
1960    2022093
1961    2017316
1958    2010884
Name: x, dtype: int64

In [93]:
#7.
df['x_rate(x/(x+y))'] = df.loc[:,'x']/df.sum(axis=1)

In [118]:
#8.
df['x_quantity'] = df.loc[2000:,'x'].apply(lambda v: 'many' if v>=1800000 else 'few')
df.loc[2000:,['x','y','x_quantity']]

            x        y x_quantity
year
2000  1814601  1962406       many
2001  1799049  1941251        few
2002  1795206  1939815        few
2003  1825359  1973434       many
2004  1834145  1982794       many
2005  1845379  1994841       many
2006  1898463  2052377       many
2007  1919408  2072139       many
2008  1887234  2036289       many
2009  1832925  1979303       many
2010  1772738  1913851        few
2011  1753500  1893230        few

In [176]:
df1800s = df.loc[1800:1899,['x','y']].mean().round(2)
df1900s = df.loc[1900:1999,['x','y']].mean().round(2)
df2000s = df.loc[2000:2099,['x','y']].mean().round(2)

years = pd.DataFrame([df1800s,df1900s,df2000s])
years.index = ['1800s','1900s','2000s']
years

                x           y
1800s   176714.15   111820.55
1900s  1362901.51  1384145.55
2000s  1831500.58  1978477.50